Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: (Not currently supported!)
zh_cn: (目前不支持!)

source: (This is the default setting.)
zh_cn: (这是默认设置。)

source: 0 (although any value less than 1 will also evaluate as false)
zh_cn: 0(尽管任何小于1的值也将被赋值为false)

source: 0 = automatic, 1 = full image, 2 = user defined.
zh_cn: 0 =自动，1 =完整图像，2 =用户定义。

source: 0 is the start of the path, 1 is the end of the path, and anything in between equates to that far through the path.
zh_cn: 0是路径的起点，1是路径的终点，而两者之间的值等于路径的这段距离。

source: 0 is the start of the path, 1 is the end of the path, and anything in between equates to the normalised distance along the length of the path.
zh_cn: 0是路径的起点，1是路径的终点，两者之间的任何值都等于路径长度上的标准化距离。

source: 0=normal, 90=turned 90 degrees counter-clockwise etc.
zh_cn: 0 =正常，90 =逆时针旋转90度等。

source: 0=right way up, 90=rotated 90 degrees counter-clockwise etc...
zh_cn: 0 = 向右，90 = 逆时针旋转 90 度等...

source: 1 (although any value equal to or greater than 1 will evaluate as true)
zh_cn: 1(尽管任何等于或大于1的值都将被赋值为真)

source: 1 = one single image / *.gif.
zh_cn: 1 = 一张图像 / *.gif。

source: 3.141592653589793280etc... (the exact value will depend on various factors like the platform being targeted)
zh_cn: 3.141592653589793280等等……(具体数值取决于各种因素，如目标平台)

source: 3D (5.1) audio.
zh_cn: 3D (5.1) 音频。

source: A 16bit float.
zh_cn: 一个16位浮点数。

source: A 1x1 pixel.
zh_cn: 一个1x1像素。

source: A 32bit float.
zh_cn: 一个32位浮点数。

source: A 3px outlined circle.
zh_cn: 3px轮廓的圆。

source: A 64bit float.
zh_cn: 64位浮点数。

source: A Linear distribution where all particles have an equal chance of appearing anywhere in the area.
zh_cn: 一种线性分布，其中所有粒子在该区域的任何地方出现的机会相等。

source: A boolean value.
zh_cn: 一个布尔值。

source: A brief description of the data being stored.
zh_cn: 对所存储数据的简要描述。

source: A buffer of fixed size.
zh_cn: 固定大小的缓冲区。

source: A buffer that will "grow" dynamically as data is added
zh_cn: 随着数据的增加，缓冲区将动态"增长"

source: A buffer where the data will "wrap".
zh_cn: 数据将在其中"包装"的缓冲区。

source: A chain fixture is comprised of a number of points, which are then connected together using edge shapes to join them.
zh_cn: 链式夹具由许多点组成，然后使用边缘形状将这些点连接在一起。

source: A channel struct has the following variables:
zh_cn: 通道结构具有以下变量：

source: A circle with an inward glow (looks like a bubble).
zh_cn: 向内发光的圆(看起来像泡泡)。

source: A circle with an outward glow ' solid in the middle, glowing outwards.
zh_cn: 一个向外发光的圆，中间实心，向外发光。

source: A closed path has its start point connected to its end point, forming a loop, and an open path has a definitive, unconnected start and finish.
zh_cn: 封闭路径的起点与终点相连，形成一个循环，而开放路径有明确的、不相连的起点和终点。

source: A common example of use in programming would be to calculate the number of bits that are needed to represent a number.
zh_cn: 编程中一个常见的例子是计算表示一个数所需的位数。

source: A default value of 0 will clear all the tiles from the layer (essentially making all tiles "empty"), while you can use the dedicated tile_* functions to create your own tile data to clear the tile map with.
zh_cn: 默认值为0将清除该层中的所有tile(本质上是使所有tile为"空")，而你可以使用专用的tile_*函数创建自己的tile数据来清除tile地图。

source: A diamond collision mask shape
zh_cn: 菱形碰撞遮罩形状

source: A diamond shape with the points at half width and half height.
zh_cn: 一种菱形形状，其顶点半宽半高。

source: A ds_list of points to use to create the polygon.
zh_cn: 用于创建多边形的点的ds_list。

source: A ds_map with the required header fields
zh_cn: 一个ds_map，其中包含所需的报头字段

source: A duplicated sprite will be places on its own unique texture page when created, meaning that duplicating multiple sprites will create multiple texture pages and have an impact on performance, so use this function only when necessary.
zh_cn: 创建时，复制的精灵将被放置在自己唯一的纹理页面上，这意味着复制多个精灵将创建多个纹理页面，并对性能产生影响，因此仅在必要时通过此函数。

source: A dynamic instance is one that is fully simulated within the physics world and this read-only variable will return true if the instance being checked is fully simulated or false if it is not
zh_cn: 动态实例是在物理世界中完全模拟的实例，如果被检查的实例是完全模拟的，这个只读变量将返回true，否则返回false

source: A filled circle.
zh_cn: 实心圆。

source: A filled square.
zh_cn: 实心正方形。

source: A five-point filled star.
zh_cn: 填充五角星形。

source: A force is any influence that causes an object to undergo a change in speed, a change in direction, or a change in shape, and is defined in the GameMaker physics world the same as we define gravity, by getting the vector from the two xforce/yforce components.
zh_cn: 力是导致物体经历速度变化、方向变化或形状变化的任何影响，在GameMaker物理世界中的定义与我们定义重力相同，通过从两个xforce/yforce分量获得矢量。

source: A frozen buffer can be submitted to the shader faster than a normal, dynamic buffer and is recommended for those effects that require an unchanging custom primitive for the duration of a level or the game.
zh_cn: 冻结的缓冲区可以比正常的动态缓冲区更快地提交到着色器，建议用于那些在关卡或游戏期间需要不变的自定义图元的效果。

source: A full path is only found there was no collision with the specified object or instance and if false is returned then a path is still generated, but it will only run up to the position where the path was blocked.
zh_cn: 只有在与指定的对象或实例没有碰撞的情况下才能找到完整的路径，如果返回false，则仍然会生成路径，但它只会运行到路径被阻止的位置。

source: A function to be called for each character in range (allows arguments 'char' and 'pos').
zh_cn: 为范围内的每个字符调用的函数(允许实参'char'和'pos')。

source: A further example is provided below.
zh_cn: 下面提供了另一个例子。

source: A gaussian distribution where more particles are generated in the center rather than the edges.
zh_cn: 一种高斯分布，其中更多的粒子在中心而不是边缘生成。

source: A generic snowflake shape.
zh_cn: 普通的雪花形状。

source: A gesture event (Tap, Drag, Flick, Pinch or Rotate)
zh_cn: 手势事件(点击、拖动、轻击、挤压或旋转)

source: A grid data structure
zh_cn: 网格数据结构

source: A harshly glowing point (looks like an actual star in the night).
zh_cn: 一个剧烈发光的点(看起来像夜晚的一颗真正的星星)。

source: A kinematic instance is one that has infinite mass (a density of 0) but can move.
zh_cn: 运动学实例具有无限质量(密度为0)但可以移动。

source: A list data structure
zh_cn: 列表数据结构

source: A map data structure
zh_cn: 映射数据结构

source: A multiplier ' 1 = normal scaling, 0.5 is half etc.
zh_cn: 乘数 1 =正常比例，0.5是一半等。

source: A path is created from a series of defining points that are linked together and then used to plan the movements of an instance.
zh_cn: 路径由一系列链接在一起的定义点创建，然后用于规划实例的移动。

source: A persistent instance is one that will be "carried over" from room to room, meaning (for example) that it only has to be created once at the start of the game and it will be present in all further rooms.
zh_cn: 一个持久的实例是一个将从一个房间"带到"另一个房间的实例，这意味着(例如)它只需在游戏开始时创建一次，并且它将出现在所有其他房间中。

source: A persistent object is "carried over" from room to room and maintains its properties at all times (for more information on persistence see the section on the Object Editor).
zh_cn: 持久化对象从一个房间"转移"到另一个房间，并始终维护其属性(有关持久化的更多信息，请参阅对象编辑器一节)。

source: A persistent object is one that will cause any instances of it to be carried through from room to room unless they are explicitly destroyed.
zh_cn: 持久对象将导致它的任何实例从一个房间带到另一个房间，除非它们被显式地销毁。

source: A polygon (primitive) has a front and a back side.
zh_cn: 一个多边形(图元)有一个正面和一个背面。

source: A position relative to the current read/write position
zh_cn: 相对于当前读/写位置的位置

source: A precise collision mask, where the mask will conform to the non-transparent pixels of the sprite, based on the tolerance value given (see below))
zh_cn: 一个精确的碰撞遮罩，该遮罩将根据给定的容差值(见下文)与精灵的不透明像素相一致

source: A previously defined revolute joint
zh_cn: 先前定义的转动关节

source: A previously defined revolute or prismatic joint
zh_cn: 转动关节先前定义的转动关节或移动关节

source: A previously initialised array of floating point values.
zh_cn: 先前初始化的浮点值数组。

source: A previously initialised array of integer values.
zh_cn: 先前初始化的整数值数组。

source: A primitive consisting of a list of points.
zh_cn: 由一列点组成的图元。

source: A primitive made up of a consecutive strip of lines.
zh_cn: 由连续的条形线组成的图元。

source: A primitive made up of a consecutive strip of triangles.
zh_cn: 由一连串三角形组成的图元。

source: A primitive made up of a individual lines in a list.
zh_cn: 由列表中的单个行组成的图元。

source: A primitive made up of individual triangles in a list.
zh_cn: 由列表中各个三角形组成的图元。

source: A priority data structure
zh_cn: 优先级数据结构

source: A queue data structure
zh_cn: 队列数据结构

source: A ratio of 32:1 will be specified as 1/32 (or 0.03125).
zh_cn: 32:1的比率将被指定为1/32(或0.03125)。

source: A real number argument
zh_cn: 实数参数

source: A rectangular (non-rotating) rectangle collision mask shape
zh_cn: 矩形(非旋转)矩形碰撞遮罩形状

source: A rectangular shape that fills the given area.
zh_cn: 填充给定区域的矩形。

source: A revolute joint forces two bodies to share a common anchor point (often called a hinge point) and the joint has a single degree of freedom - the relative rotation of the two bodies around this point.
zh_cn: 转动关节迫使两个物体共用一个锚点(通常称为铰链点)，关节只有一个自由度——两个物体围绕这个点的相对旋转。

source: A room with persistence flagged as true it will maintain the state of all instances within that room if the player leaves and then returns, whereas if persistence is flagged as false it will be reset to the initial state every time.
zh_cn: 如果玩家离开后又回来，一个持久标记为真的房间将保持该房间内所有实例的状态，而如果持久标记为假，每次都将重置为初始状态。

source: A rope joint is one which is used to join two instances that you want to keep a constant distance apart, no matter what other forces are acting on it.
zh_cn: 绳子连接是用来连接两个实例，你想要保持一个恒定的距离，无论其他的力作用在它上面。

source: A scale of 1 indicates no scaling (1:1), smaller values will scale down (0.5, for example, will half the height of the sprite used), larger values will scale up, and negative values will mirror the sprite and scale it unless the value used is exactly -1 (in which case the sprite used is just mirrored top-to-bottom about its (0, 0) position with no scaling).
zh_cn: 比例为1表示不缩放(1:1)，较小的值将缩小(例如，0.5将是所用sprite高度的一半)，较大的值将放大，负值将镜像sprite并缩放它，除非所用的值正好是-1(在这种情况下，所用的sprite只是围绕其(0，0)位置从上到下镜像，而不缩放)。

source: A scale of 1 indicates no scaling (1:1), smaller values will scale down (0.5, for example, will half the height of the sprite), larger values will scale up and negative values will mirror the sprite and scale it unless the value used is exactly -1 (in which case the sprite is just mirrored along the y-axis with no scaling).
zh_cn: 1的比例表示不能缩放(1:1)，较小的值将缩小(例如，0.5是精灵高度的一半)，较大的值将扩大，负值将镜像精灵并缩放它，除非使用的值正好是-1(在这种情况下，精灵只是沿y轴镜像，没有缩放)。

source: A scale of 1 indicates no scaling (1:1), smaller values will scale down (0.5, for example, will half the width of the sprite used), larger values will scale up, and negative values will flip the sprite and scale it unless the value used is exactly -1 (in which case the sprite used is just flipped right-to-left about its origin position with no scaling).
zh_cn: 比例为1表示没有缩放(1:1)，较小的值会缩小(例如，0.5会是所使用精灵宽度的一半)，较大的值会放大，负值会翻转并缩放精灵，除非所使用的值正好为-1(在这种情况下，所使用的精灵只是围绕其原始位置从右向左翻转，而没有缩放)。

source: A scale of 1 indicates no scaling (1:1), smaller values will scale down (0.5, for example, will half the width of the sprite), larger values will scale up and negative values will flip the sprite and scale it unless the value used is exactly -1 (in which case the sprite is just flipped about its origin with no scaling).
zh_cn: 1的比例表示不能缩放(1:1)，较小的值将缩小(例如，0.5将是精灵宽度的一半)，较大的值将扩大，负值将翻转精灵并缩放它，除非所使用的值正好是-1(在这种情况下，精灵只是沿着原点翻转而没有缩放)。

source: A signed, 16bit integer.
zh_cn: 一个带符号的16位整数。

source: A signed, 32bit integer.
zh_cn: 带符号的32位整数。

source: A signed, 8bit integer.
zh_cn: 一个带符号的8位整数。

source: A single asset tag string or an array with various asset tags.
zh_cn: 单个资源标记字符串或具有各种资源标记的数组。

source: A single click/touch and release has been detected anywhere in the room
zh_cn: 在房间的任何地方都检测到了单击/触摸和释放

source: A single click/touch and release has been detected for an instance
zh_cn: 在一个实例中检测到一个单一的点击/触摸和释放

source: A single floating point value
zh_cn: 单个浮点值

source: A single line, where the start point is the left and top and the end point is the right and bottom.
zh_cn: 一条直线，起点在左上方，终点在右下方。

source: A single skeletal animation sprite can have various animation sets, and these sets can be assigned different tracks so that you can "mix and match" animation sets.
zh_cn: 单个骨骼动画精灵可以有各种动画集，这些集可以指定不同的轨迹，以便您可以"混合和匹配"

source: A skeletal animation sprite can be drawn with a variety of textures (called "skins"), permitting you to use one single animation for multiple different purposes.
zh_cn: 骨骼动画精灵可以用各种纹理(称为"皮肤")绘制，允许您将一个动画用于多种不同的目的。

source: A skeletal animation sprite may have other images added as attachments, with these images being added to a named slot (the name is given when you create the attachment slot in your animation program) and they will be drawn along with the animation of the current sprite.
zh_cn: 骨骼动画精灵可以将其他图像作为附件添加，这些图像被添加到一个命名的槽中(该名称是在动画程序中创建附件槽时给出的)，它们将与当前精灵的动画一起绘制。

source: A skeletal animation sprite may have other sprites added as attachments, with these sprites being added to a named slot (the name is given when you create the attachment slot in your animation program) and they will be drawn along with the animation of the current sprite.
zh_cn: 骨骼动画精灵可以将其他精灵作为附件添加，这些精灵被添加到一个命名的槽中(该名称是在动画程序中创建附件槽时给出的)，它们将与当前精灵的动画一起绘制。

source: A smooth gradient change will occur through the alphas over the particles lifetime from one to the other.
zh_cn: 在粒子的生命周期中，从一个粒子到另一个粒子会发生平滑的梯度变化。

source: A smooth gradient change will occur through the colours over the particles lifetime from one colour to the other.
zh_cn: 从一种颜色到另一种颜色，在粒子的整个寿命期间，颜色将发生平滑的梯度变化。

source: A smooth version of the explosion effect.
zh_cn: 爆炸效果的平滑版本。

source: A solid object generates a special collision event when using the traditional collision system (ie: the physics world is off).
zh_cn: 当使用传统的碰撞系统时，固体会产生特殊的碰撞事件(即物理世界关闭)。

source: A solid particle group prevents other fixtures from lodging inside of it.
zh_cn: 一个固体粒子组可以防止其他设备在里面住宿。

source: A spark effect ' like a star with multiple points fading out.
zh_cn: "火花效果"就像星星的多个光点逐渐消失。

source: A special constant that is for "and"-ing with the tile data blob to extract the tile index.
zh_cn: 一个特殊的常量，用于"and" -ing"与tile数据blob一起提取tile索引。

source: A sprite has to have at least one sub-image and this function will return just how many it has.
zh_cn: 一个精灵必须至少有一个子图像，此函数将返回它有多少子图像。

source: A sprite is made up of one or more sub-images which can make the sprite appear animated as they switch from one to the other, or can they can be switched between in code to give different "states", much like a button has in windows.
zh_cn: 精灵由一个或多个子图像组成，当它们从一个切换到另一个时，这些子图像可以使精灵看起来有动画效果，或者它们可以在代码中切换以提供不同的"状态"，就像窗口中的按钮一样。

source: A sprite of the avatar associated with this player in Opera GX, for rollback networking.
zh_cn: 在Opera GX中，与此玩家相关联的头像精灵，用于回滚联网。

source: A squarish cloud of smoke ' requires multiple colours to resemble an explosion.
zh_cn: "方形烟云"需要多种颜色来模拟爆炸。

source: A stack data structure
zh_cn: 堆栈数据结构

source: A string of any size, without the final null terminating character.
zh_cn: 任意大小的字符串，不包含最后的空结束字符。

source: A string of any size.
zh_cn: 任意大小的字符串

source: A string to send to the provider
zh_cn: 要发送给提供程序的字符串

source: A string to send to the provider.
zh_cn: 要发送给提供程序的字符串。

source: A string with one of the commands listed below.
zh_cn: 包含下面列出的命令之一的字符串。

source: A struct containing a set of playback parameters.
zh_cn: 包含一组回放参数的结构。

source: A struct containing any initial values for the effect's parameters.
zh_cn: 包含效果参数的任何初始值的结构。

source: A struct containing the parameters for the filter/effect
zh_cn: 包含滤镜/效果参数的结构

source: A structure that contains variables that are copied into the new instance before the Create Event is called
zh_cn: 一个结构，其中包含在调用创建事件之前复制到新实例中的变量

source: A texel, or texture element is the fundamental unit of texture space used in computer graphics.
zh_cn: 纹理元素是计算机图形学中使用的纹理空间的基本单位。

source: A thin cloud, requires up scaling and multiple particles to resemble a cloud.
zh_cn: 薄云，需要放大和多个粒子来模拟云。

source: A touch/click has been held and moved anywhere in the room
zh_cn: 在房间的任何地方检测到触摸/点击被按住并移动

source: A touch/click has been held and moved for an instance
zh_cn: 一个触摸/点击已经被按住并移动了一个实例

source: A value of 1 is the default value, and values lower than 1 mean that playback is slowed down and values greater than 1 mean that playback is sped up.
zh_cn: 默认值为1，小于1的值表示回放速度变慢，大于1的值表示回放速度加快。

source: A viscous particle is one that exhibits "clinginess" or "stickiness", like oil.
zh_cn: 粘性颗粒是一种表现出"粘性"的颗粒，就像油一样。

source: A wheel joint simply combines a piston and a revolute joint, like a wheel mounted on the shock absorber of a car.
zh_cn: 车轮关节只是将活塞和旋转关节结合在一起，就像安装在汽车减震器上的车轮一样。

source: A zombie particle is one that will be destroyed after a single step with all others flagged in this way.
zh_cn: 僵尸粒子是这样一种粒子，它将在一个单独的步骤后被摧毁，所有其他粒子都以这种方式被标记。

source: AA simply smooths the edges of vector images to give them a nicer look.
zh_cn: AA 只是简单地平滑矢量图像的边缘，使它们看起来更漂亮。

source: Accepts the following arguments (index) and should return the init value of the element.
zh_cn: 接受以下参数(index)，并应返回元素的初始值。

source: Accepts the following arguments (prev, value, index) and should return a new 'prev'.
zh_cn: 接受以下参数(prev, value, index)，并返回一个新的'prev'。

source: Accepts the following arguments (value, index) and should return a boolean.
zh_cn: 接受以下参数(值、索引)并应返回一个布尔值。

source: Accepts the following arguments (value, index) and should return the mapped value.
zh_cn: 接受以下参数(值、索引)，并应返回映射的值。

source: Accepts the following arguments (value, index).
zh_cn: 接受以下参数(值、索引)。

source: Additionally resets all of the time source's children.
zh_cn: 另外，重置所有时间源的子级。

source: Additive blending is a special blend mode that adds the luminosity values of each particle as they overlap, so that light colours will gradually get brighter (until they appear white) as they overlap, and dark colours become more and more transparent with black being almost invisible.
zh_cn: 添加混合是一种特殊的混合模式，当它们重叠时，添加每个粒子的光度值，因此浅色会随着它们重叠而逐渐变亮(直到它们变成白色)，而深色则变得越来越透明，黑色几乎看不见。

source: Additive blending.
zh_cn: 叠加混合。

source: After that you set the x and y coordinate (corresponding to the top left position of the view port) and then the width and height in pixels.
zh_cn: 之后，您设置x和y坐标(对应于视窗的左上位置)，然后以像素为单位设置宽度和高度。

source: After that, keypresses to either key will be interpreted by GameMaker as coming from key2.
zh_cn: 在那之后，按下任何一个键都会被GameMaker解释为来自键2。

source: After waiting a step it should return the new size correctly.
zh_cn: 在等待一个步骤后，它应该返回正确的新大小。

source: Alarm event
zh_cn: 警报事件(计时器)Alarm event

source: All cells within the grid will then contain this value, which can be a real number or a string.
zh_cn: 网格中的所有单元格都将包含此值，该值可以是实数或字符串。

source: All checks will be from the given x/y position to the origin (the x/y position) of instances of the object specified.
zh_cn: 所有的检查都是从给定的x/y位置到指定对象实例的原点( x / y 位置)。

source: All clockwise triangles will be culled
zh_cn: 所有顺时针三角形都将被剔除

source: All counter-clockwise triangles will be culled
zh_cn: 所有逆时针三角形都将被剔除

source: All instances have a unique identifier (id) which can be used to modify and manipulate them while a game is running, but you may not always know what the id for a specific instance is and so this function can help as you can use it to iterate through all of them to find what you need.
zh_cn: 指定要查找实例的对象和一个数字，如果实例列表中该位置有实例，则函数返回该实例的id，如果没有，则返回特殊关键字noone。

source: All instances in GameMaker have certain "built in" properties that you can use and set to govern how they look and behave.
zh_cn: GameMaker中的所有实例都有特定的"内置"属性，你可以使用和设置这些属性来控制它们的外观和行为。

source: All other cells will be left untouched.
zh_cn: 所有其他单元格将保持不变。

source: All resources in GameMaker have a unique identifying number, and the path_index is a read-only variable that holds the index value for a given path resource that has been assigned to an instance using the path_start() function.
zh_cn: GameMaker中的所有资源都有一个唯一的标识号，path_index是一个只读变量，它保存使用path_start()函数分配给实例的给定路径资源的索引值。

source: All this function does is take the ID and return a string of the ID name you gave.
zh_cn: 此函数所做的就是接受ID并返回您给出的ID名称的字符串。

source: All values must be between 0 and 255.
zh_cn: 所有值必须介于0和255之间。

source: Alpha can be between 0 (fully transparent) and 1 (fully opaque) with the default alpha value for the background element being 1.
zh_cn: 透明度(Alpha)可以在0(完全透明)和1(完全不透明)之间，背景元素的默认alpha值为1。

source: Alpha can be between 0 (fully transparent) and 1 (fully opaque) with the default alpha value for the sprite element being 1.
zh_cn: 透明度(Alpha)值可以介于0(完全透明)和1(完全不透明)之间，精灵元素的默认Alpha值为1。

source: Alpha is always calculated as a value between 0 and 1 where 0 is completely transparent and 1 is completely opaque.
zh_cn: Alpha总是计算为0到1之间的值，其中0是完全透明的，1是完全不透明的。

source: Also note that a value of -1 for the line separation argument will default to a separation based on the height of the "M" character in the chosen font.
zh_cn: 还要注意，行分隔参数的值-1将默认为基于所选字体中"M"字符的高度的分隔。

source: Also note that if the layer that the instance is assigned to is flagged as invisible, setting this variable to true will have no effect until the layer itself is flagged as visible too.
zh_cn: 另注意，如果实例所分配到的层被标记为不可见，则将此变量设置为true将不起作用，直到该层本身也被标记为可见。

source: Also note that if you call the function ds_list_clear() on a list, any items flagged as lists will be destroyed as well when the list is cleared.
zh_cn: 还要注意，如果您在列表上调用函数ds_list_clear()，那么当列表被清除时，任何标记为列表的项目也将被销毁。

source: Also note that if you call the function ds_list_clear() on a list, any items flagged as maps will be destroyed as well when the list is cleared.
zh_cn: 还要注意，如果您在列表上调用函数ds_list_clear()，那么当列表被清除时，任何标记为地图的项目也将被销毁。

source: Also note that on HTML5 only "device 0" will function correctly and other devices may give wrong values.
zh_cn: 还要注意，在HTML5上只有"设备0"能够正常工作，其他设备可能会给出错误的值。

source: Also note that this function will not work on HTML5 unless it's added in as a "clickable" callback (see here for more details).
zh_cn: 还要注意，此函数不能在HTML5上工作，除非它被添加为"可点击"回调(参见这里了解更多细节)。

source: Also note that using this function on a variable storing an array, a data structure, or a struct will convert the contents of these variables into a string which can then be output to the console or saved to a file for debugging.
zh_cn: 还要注意，对存储数组、数据结构或结构的变量使用此函数会将这些变量的内容转换为字符串，然后可以将该字符串输出到控制台或保存到文件中进行调试。

source: Altering this for a static instance (ie: an instance with 0 density) will turn it into a kinematic instance
zh_cn: 为静态实例(例如:密度为0的实例)更改此属性会将其转换为运动实例

source: Altering this for a static instance (ie: an instance with 0 density) will turn it into a kinematic instance.
zh_cn: 为静态实例(例如:密度为0的实例)更改此属性会将其转换为运动实例。

source: Although the function uses the word "healthbar" you can use this to display anything you wish as long as the amount to be displayed is a percentage value between 0 and 100 (a percentage of any value can be calculated with the formula (CURRENT_Value / MAXIMUM_value) * 100), so, for example, you can use this to display power, health, mana, time or anything else that would benefit from a bar display.
zh_cn: 尽管此函数使用了单词"healthbar ",但您可以使用它来显示您想要的任何内容，只要要显示的数量是0到100之间的百分比值(任何值的百分比都可以通过公式(CURRENT _ Value/MAXIMUM _ Value)* 100)来计算)，因此，例如，您可以使用它来显示电量、生命值、法力值、时间或任何其他可以从条形显示中受益的内容。

source: Although you can get (and set) this value for a straight-line path it will have no influence over how an instance uses the path as it is only relevant when the path kind is set to "smooth".
zh_cn: 尽管你可以为直线路径获取(并设置)这个值，但它不会影响实例如何使用该路径，因为它只在路径类型设置为"光滑"时才相关。

source: An 8px wide horizontal line.
zh_cn: 8px宽的水平线。

source: An array of delimiter strings to search for.
zh_cn: 要搜索的分隔符字符串数组。

source: An array of values be concatenated.
zh_cn: 要连接的值数组。

source: An array of values be joined using the delimiter.
zh_cn: 使用分隔符连接的值数组。

source: An array of values to be replaced on the format string (non-string elements will be converted to string).
zh_cn: 要在格式字符串上替换的值数组(非字符串元素将转换为字符串)。

source: An array of values to be search inside the provided array.
zh_cn: 要在提供的数组中搜索的值数组。

source: An array of values to replace the placeholders.
zh_cn: 替换占位符的值数组。

source: An asset type constant (listed above)
zh_cn: 资源类型常量(上面列出)
